DeviceProcessEvents
| where FileName in~ ("fsutil.exe","robocopy.exe","ntdsutil.exe","wbadmin.exe","vssadmin.exe","reg.exe")
| where ProcessCommandLine has_any ("\\config\\SECURITY","NTDS\ntds.dit","\\config\\SYSTEM")
| project Timestamp, DeviceName,AccountName, FileName,InitiatingProcessVersionInfoFileDescription,PWSCmd=ProcessCommandLine,FolderPath,SHA256,InitiatingProcessFileName,
InitiatingProcessCommandLine,InitiatingProcessVersionInfoCompanyName,InitiatingProcessFolderPath,InitiatingProcessSHA256,
InitiatingProcessParentFileName
