//Author: Enzo Silva Bomfim
// Identifica a execucação do comando ceruitl -urlcache
DeviceProcessEvents
| where ProcessCommandLine has "certutil" and ProcessCommandLine has "-urlcache"
| project Timestamp, DeviceName, AccountName, ProcessCommandLine, InitiatingProcessFileName,FolderPath,SHA256,ProcessVersionInfoCompanyName,InitiatingProcessParentFileName
