DeviceProcessEvents
| where ProcessCommandLine has_any ("{3E000D72-A845-4CD9-BD83-80C07C3B881F}","3E5FC7F9-9A51-4367-9063-A120244FBEC7","6EDD6D74-C007-4E75-B76A-E5740995E24C")
| where ProcessCommandLine contains "Elevation:Administrator!new"
| project Timestamp, DeviceName,AccountName, FileName, ProcessCommandLine,FolderPath,ProcessTokenElevation,SHA1,InitiatingProcessFileName,
InitiatingProcessCommandLine,InitiatingProcessVersionInfoCompanyName,InitiatingProcessFolderPath,InitiatingProcessSHA1,InitiatingProcessParentFileName
| order by Timestamp asc
