DeviceProcessEvents
| where InitiatingProcessParentFileName == "explorer.exe"
| where InitiatingProcessFileName has_any ("cmd","powershell")
| where FileName has_any ("mshta","wscript", "cscript") or 
ProcessCommandLine has_any (".vbs","hta","MSXML2.XMLHTTP", "Microsoft.XMLHTTP", "ServerXMLHTTP",".js")
| where DeviceName has_any(machines)
| project Timestamp, DeviceName,AccountName, FileName, ProcessCommandLine,SHA1,InitiatingProcessFileName,
InitiatingProcessCommandLine,InitiatingProcessVersionInfoCompanyName,InitiatingProcessFolderPath,InitiatingProcessSHA1,
InitiatingProcessParentFileName
