// Author: Enzo Silva Bomfim  
// Identifica a execução do processo findstr para localizar arquivos que contenham as palavras "senha" ou "password".
DeviceProcessEvents
| where InitiatingProcessFileName == "cmd.exe" 
| where
( 
    ProcessCommandLine has "findstr /si" and
    (
        ProcessCommandLine contains "password" or
        ProcessCommandLine contains "senha"
    )
)
| project Timestamp, DeviceName, AccountName, FileName, FolderPath, SHA256, ProcessCommandLine, InitiatingProcessFileName
