DeviceEvents 
| where ActionType == "CreateRemoteThreadApiCall"  
or ActionType == "OpenProcessApiCall" 
| where FileName =~ "lsass.exe" 
| project Timestamp, DeviceName, InitiatingProcessAccountName,  
InitiatingProcessFileName, InitiatingProcessCommandLine 
| order by Timestamp desc
