DeviceProcessEvents
| where InitiatingProcessFileName =="powershell.exe" or InitiatingProcessFileName == "cmd.exe" 
| where ProcessCommandLine contains tolower("--EncodedCommand")
| project Timestamp, DeviceName, ProcessCommandLine
