//Author: Enzo Silva Bomfim 
// Identifica módulos powershell que realizam conexoes de rede 
DeviceProcessEvents
| where FileName in ("powershell.exe", "POWERSHELL.EXE", "powershell_ise.exe", "POWERSHELL_ISE.EXE")
| where ProcessCommandLine has_any ("Net.WebClient","DownloadFile","Invoke-WebRequest","iwr","Invoke-Shellcode","http:","New-Object System.Net.Sockets.TcpClient","IEX","Invoke-Expression","DownloadString")
| project Timestamp, DeviceName,AccountName, FileName, ProcessCommandLine,SHA1,InitiatingProcessFileName,InitiatingProcessCommandLine,InitiatingProcessVersionInfoCompanyName,InitiatingProcessFolderPath,InitiatingProcessSHA1,InitiatingProcessParentFileName
