DeviceProcessEvents
| where InitiatingProcessFileName =="powershell.exe" or InitiatingProcessFileName == "cmd.exe" 
| where ProcessCommandLine has ("--EncodedCommand")
| project Timestamp, DeviceName, ProcessCommandLine
