DeviceProcessEvents
| where ActionType == "Process Launch"
| where 
(
  FolderPath == @"C:\Windows\Temp" or
  FolderPath  == @"C:\ProgramData" or 
  FolderPath == @"C:\Users\Public" or 
  FolderPath startswith @"C:\Users\" and FolderPath contains @"\AppData\Local"
)
| project Timestamp, DeviceName, AccountName, FileName, FolderPath, SHA256, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessSHA256
| order by Timestamp desc
