// Author: Enzo Silva Bomfim
// Identifica alterações nas chaves de registros relacionados ao RDP

DeviceRegistryEvents 
| where ActionType in ("RegistryModification", "RegistryCreation")
| where 
    (RegistryKey == @"HKLM\SYSTEM\CurrentControlSet\Control\Terminal Server" and 
     RegistryValueName == "fDenyTSConnections" and 
     RegistryValueData != "DWORD (0x00000001)") or 
    (RegistryKey == @"HKLM\SYSTEM\CurrentControlSet\Control\Terminal Server" and 
     RegistryValueName == "TSUserEnabled" and 
     RegistryValueData != "DWORD (0x00000000)")
