let ASEP_ARRAY = dynamic([
"SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Run",
"SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnce",
"SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx",
"SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunServices",
"SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce"
]);
DeviceRegistryEvents
| where RegistryKey has_any (ASEP_ARRAY)
| where ActionType == @"RegistryValueSet"
| where RegistryValueData has_any ("powershell","mshta","wscript", "cscript","mshta","python","java") 
