// Autor: Enzo Bomfim
// Busca por execução de ferramentas de acesso remoto
DeviceProcessEvents
| where InitiatingProcessFileName has_any(
    "anydesk.exe", "teamviewer.exe", "ammyy.exe", "aeroadmin.exe", "supremo.exe",
    "vncviewer.exe", "vncserver.exe", "ultraviewer_service.exe", "tvnserver.exe",
    "chromeremotedesktophost.exe", "boomgar.exe", "ngrok.exe", "jumpdesktopconnect.exe",
    "rustdesk.exe", "connectwisecontrol.Client.exe", "tigervnv.exe", "splashtop.exe",
    "remotepc.exe", "screenconnect.exe"
)
| project 
    Timestamp, 
    InitiatingProcessAccountName, 
    DeviceName, 
    FileName, 
    ProcessCommandLine, 
    InitiatingProcessFileName, 
    FolderPath, 
    SHA256, 
    ProcessVersionInfoCompanyName
