let RMM = dynamic([
  "anydesk.exe","teamviewer.exe","ammyy.exe","aeroadmin.exe","supremo.exe",
  "vncviewer.exe","vncserver.exe","ultraviewer_service.exe","tvnserver.exe",
  "chromeremotedesktophost.exe","boomgar.exe","ngrok.exe","jumpdesktopconnect.exe",
  "rustdesk.exe","connectwisecontrol.client.exe","tigervnv.exe","splashtop.exe",
  "remotepc.exe","screenconnect.exe","ntsupport.exe","xtraviewer.exe","zoho_assist.exe","quickassist.exe","hoptodesk.exe","mRemoteNG.exe"
  "LogMeIn.exe","AteraAgent.exe", "IperiusRemoteAteraAgent.exe","TightVNC.exe","UltraVNC.exe","RealVNC.exe","WebexRemote.exe""ITRemote.exe"
  "Dameware.exe","NinjaRMM.exe"
]);
DeviceProcessEvents
| where tolower(FileName) has_any (RMM) or tolower(ProcessCommandLine) has_any (RMM)
| project Timestamp, DeviceName,AccountName, FileName, ProcessCommandLine,SHA1,InitiatingProcessFileName,InitiatingProcessCommandLine,InitiatingProcessVersionInfoCompanyName,InitiatingProcessFolderPath,InitiatingProcessSHA1,InitiatingProcessParentFileName

