//Author: Enzo Silva Bomfim 
// Identifica a adição de rotas na tabela de roteamento
DeviceProcessEvents
| where InitiatingProcessFileName == "cmd.exe" or FileName == "cmd.exe"
| where ProcessCommandLine contains "route add"
| project Timestamp, DeviceName, AccountName, FileName, ProcessCommandLine, InitiatingProcessFileName, InitiatingProcessAccountName
