rule TA0003_TEC1098_AD_account_with_Dont_Expire_Password {
  meta:
    author = "Kaio Vinicius Almeida Mendes"
    description = "Identifica quando a conta de usuário está definida para ''Senha nunca expira''"
    severity = "Low"
    mitre_attack_tactic = "Persistence"
    mitre_attack_technique = "Account Manipulation"
    mitre_attack_url = "https://attack.mitre.org/techniques/T1098/"

  events:
    $e.metadata.log_type = "WINEVTLOG"
    $e.metadata.product_event_type = "4738"
    $e.target.user.attribute.labels["accountEnabled"] = "true" nocase and
    $e.target.user.attribute.labels["Password Never Expires"] = "true" nocase
    $e.principal.user.windows_sid  = $sid
  match:
    $sid over 5m

  outcome:
    $risk_score = max(0)
    $mitre_attack_tactic = array_distinct("Persistence")
    $mitre_attack_technique = array_distinct("Account Manipulation")
    $mitre_attack_technique_id = array_distinct("T1098")

  condition:
    $e
}
