TA0002_T1059_PRD_CERTUTIL_-URLCACHE_command_execution {

  meta:
    author = "Enzo Silva Bomfim"
    description = "Identifica a execução do comando CERTUTIL -URLCACHE"
    severity = "Medium"
    mitre_attack_tactic = "Execution"
    mitre_attack_technique = "Command and Scripting Interpreter"
    mitre_attack_url = "https://attack.mitre.org/techniques/T1059/"

  events:
  $e.metadata.event_type = "PROCESS_LAUNCH"
  $e.principal.process.file.full_path = /cmd|pwsh|powershell/ nocase or
  $e.target.process.file.full_path = /cmd|pwsh|powershell/ nocase 
  $e.target.process.command_line = /certutil -urlcache/ nocase
  $e.metadata.event_type = $action
    match:
        $action over 1h
  outcome:
       $mitre_attack_tactic = array_distinct("Execution")
       $mitre_attack_technique = array_distinct("Command and Scripting Interpreter")
       $mitre_attack_technique_id = array_distinct("T1059")
  condition:
    $e
}
