TA0002_T1059_PRD_PowerShell_Suspect_Network/Code_Execution {

  meta:
    author = "Enzo Silva Bomfim"
    description = "Identifica processos powershell que estabelecem conexões de rede"
    severity = "Medium"
    mitre_attack_tactic = "Execution"
    mitre_attack_technique = "Command and Scripting Interpreter"
    mitre_attack_url = "https://attack.mitre.org/techniques/T1059/"

  events:
    $e.metadata.event_type = "PROCESS_LAUNCH" 
(
$e.target.process.file.full_path = /powershell|pwsh/ or
$e.principal.process.file.full_path = /cmd.exe/ or
$e.principal.process.file.full_path = /powershell|pwsh/
) and
(
$e.target.process.command_line = /webclient|webrequest|tcpclient|socket|shellcode|curl/ nocase 
) 
$e.metadata.event_type = $action
    match:
        $action over 1h
  outcome:
       $mitre_attack_tactic = array_distinct("Execution")
       $mitre_attack_technique = array_distinct("Command and Scripting Interpreter")
       $mitre_attack_technique_id = array_distinct("T1059")
  condition:
    $e
}
