rule TA0003_T1133_PRD_RDP_Registry_modification  {

  meta:
    author = "Enzo Silva Bomfim"
    description = "Identifica execução do comando whoami"
    type = "alert"
    severity = "Low"
    mitre_attack_tactic = "Persistence"
    mitre_attack_technique = "External Remote Services"
    mitre_attack_url = "https://attack.mitre.org/techniques/T1133/"

  events:
    (($e.metadata.event_type = "REGISTRY_MODIFICATION") or ($e.metadata.event_type = "REGISTRY_CREATION")) 
    (
        (
            $e.target.registry.registry_key = /HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Serve/ and
            $e.target.registry.registry_value_name = "fDenyTSConnections" and 
            $e.target.registry.registry_value_data != "DWORD (0x00000001)"

        )
        or
        (
            $e.target.registry.registry_key = /HKLM\\SYSTEM\\CurrentControlSet\\Control\\Terminal Serve/ and
            $e.target.registry.registry_value_name = "TSUserEnabled" and 
            $e.target.registry.registry_value_data != "DWORD (0x0000000)"
        )
        
    )

  outcome:
    $mitre_attack_tactic = array_distinct("Persistence")
    $mitre_attack_technique = array_distinct("External Remote Services")
    $mitre_attack_technique_id = array_distinct("T1133")

  condition:
    $e
}
