rule TA0043_T1595_WAF_active_recon_from_offensive_tools {
  

  meta:
    author = "Enzo Silva Bomfim"
    description = "Identifica requisições não bloqueadas no WAF que possuem user-agents de ferramentas ofensivas (red team)"
    type = "alert"
    severity = "High"
    priority = "High"
    mitre_attack_tactic = "Reconnaissance"
    mitre_attack_technique = "Active scanning"
    mitre_attack_url = "https://attack.mitre.org/techniques/T1595/"

  events:
     $e.event.metadata.product_name = "XXXXXXXX"
     $e.event.event.security_result.action != "BLOCK" nocase
     $e.metadata.log_type = "AWS_WAF" 
     $e.extracted.fields["action"] != "BLOCK" 
     $e.network.http.user_agent = /.*(arachni|betabot|bewica-security-scan|sqlmap|hydra|gobuster|feroxbuster|amass|nuclei|detectify|dirbuster|ffuf|nessus|nikto|openvas|wpscan|wprecon|wfuzz|spiderfoot|reconftw|subzy|cloudbrute|AORT|AWSBucketDump|gowitness).*/ nocase
     $e.network.http.user_agent = $action
      match:
         $action over 1h
  outcome:
    $mitre_attack_tactic = array_distinct("Reconnaissance")
    $mitre_attack_technique = array_distinct("Active scanning")
    $mitre_attack_technique_id = array_distinct("T1595")

  condition:
    $e
}
