rule KRP_TA0001_T1190_HOMOL_WAF_path_traversal {
  meta:
    author = "Enzo Silva Bomfim"
    description = "Detects path traversal attempts in web traffic"
    type = "alert"
    severity = "high"
    mitre_attack_tactic = "Initial Access"
    mitre_attack_technique = "Exploit Public-Facing Application"
    mitre_attack_technique_id = "T1190"
    mitre_attack_url = "https://attack.mitre.org/techniques/T1190/"
  events:
   $e.metadata.log_type = "AWS_WAF" and
    $e.extracted.fields["action"] != "BLOCK" and
    re.regex($e.network.http.referral_url,"(?:\\/etc\\/(?:passwd|shadow|hosts)|\\/proc\\/self\\/environ|\\/var\\/log\\/|\\/boot\\/grub)")

  outcome:
    $mitre_attack_tactic = array_distinct("Initial Access")
    $mitre_attack_technique = array_distinct("Exploit Public-Facing Application")
    $mitre_attack_technique_id = array_distinct("T1190")
    $source_ip = array_distinct($e.src.ip)
    $http_method = array_distinct($e.network.http.method)
    $user_agent = array_distinct($e.network.http.user_agent)

  condition:
    $e
}
