rule TA0043_TEC1592_Whoami_Advanced_Detection {
  meta:
    author = "Kaio Vinicius Almeida Mendes"
    description = "Detecta padrões de execução do comando whoami, incluindo variações evasivas"
    type = "alert"
    severity = "Medium"
    mitre_attack_tactic = "Reconnaissance"
    mitre_attack_technique = "Gather Victim Host Information"
    mitre_attack_url = "https://attack.mitre.org/techniques/T1592/"

  events:
    $event.metadata.event_type = "PROCESS_LAUNCH"
    $event.principal.process.file.full_path = /(?i)(\\|\/)(cmd|powershell|pwsh|wscript|cscript|bash|sh|python)(\.exe)?$/
    $event.target.process.command_line = /(?i)(whoami(\s+\/(user|groups|priv))?|["']?whoami["']?|whoami\s*[|&>])/
    $event.principal.process.command_line = /(?i)(-encodedcommand|invoke-expression|eval|exec|from subprocess|shell=True)/
    
    outcome:
    $mitre_attack_tactic = array_distinct("Reconnaissance")
    $mitre_attack_technique = array_distinct("Gather Victim Host Information")
    $mitre_attack_technique_id = array_distinct("T1592")

  condition:
    $event  
}
